Hi @paultyng Thanks for raising this issue.  This issue involves a rather difficult choice that we analyzed earlier, involving the design of Terraform and the usage of the CLI. First provide a quick workaround:

```
# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

resource "fortios_firewallservice_custom" "trname" {
  name                = "Custom-Test1"
  protocol            = "TCP/UDP/SCTP"
  tcp_portrange       = "223-3312"
}

# terraform apply
.................

# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

resource "fortios_firewallservice_custom" "trname" {
  name                = "Custom-Test1"
  protocol            = "TCP/UDP/SCTP"
  udp_portrange       = "223-3312"  <============ Changed
}
```
**Use taint:**
```
# terraform taint fortios_firewallservice_custom.trname
Resource instance fortios_firewallservice_custom.trname has been marked as tainted.

```
```
# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewallservice_custom.trname: Refreshing state... [id=Custom-Test1]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # fortios_firewallservice_custom.trname is tainted, so must be replaced
-/+ resource "fortios_firewallservice_custom" "trname" {
      ~ app_service_type    = "disable" -> (known after apply)
      + category            = (known after apply)
      ~ check_reset_range   = "default" -> (known after apply)
      ~ color               = 0 -> (known after apply)
      + fqdn                = (known after apply)
      ~ helper              = "auto" -> (known after apply)
      ~ icmpcode            = 0 -> (known after apply)
      ~ icmptype            = 0 -> (known after apply)
      ~ id                  = "Custom-Test1" -> (known after apply)
      ~ iprange             = "0.0.0.0" -> (known after apply)
        name                = "Custom-Test1"
        protocol            = "TCP/UDP/SCTP"
      ~ protocol_number     = 0 -> (known after apply)
      ~ proxy               = "disable" -> (known after apply)
      + sctp_portrange      = (known after apply)
      + session_ttl         = (known after apply)
      ~ tcp_halfclose_timer = 0 -> (known after apply)
      ~ tcp_halfopen_timer  = 0 -> (known after apply)
      ~ tcp_portrange       = "223-3312" -> (known after apply)
      ~ tcp_timewait_timer  = 0 -> (known after apply)
      ~ udp_idle_timer      = 0 -> (known after apply)
      + udp_portrange       = "223-3312"
      ~ visibility          = "enable" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

# terraform apply
........

```

**Validation:**
```
mysho (Custom-Test1) # show
config firewall service custom
    edit "Custom-Test1"
        set udp-portrange 223-3312
    next
end
```